import * as React from 'react';
  const Alert20FilledIcon = () => {
    return(
    <?xml version="1.0" encoding="UTF-8"?>
<svg width="20px" height="20px" viewBox="0 0 20 20" version="1.1" xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink">
    <!-- Generator: Sketch 63.1 (92452) - https://sketch.com -->
    <title>ic_fluent_alert_20_filled</title>
    <desc>Created with Sketch.</desc>
    <g id="🔍-Product-Icons" stroke="none" stroke-width="1" fill="none" fill-rule="evenodd">
        <g id="ic_fluent_alert_20_filled" fill="#212121" fill-rule="nonzero">
            <path d="M12.4496749,16.0015542 C12.2174396,17.1418999 11.2089298,18 10,18 C8.7910702,18 7.78256041,17.1418999 7.55032506,16.0015542 L12.4496749,16.0015542 Z M9.99764302,2 C13.1465962,2 15.7415396,4.33488037 15.9821165,7.35540481 L15.9954919,7.5776185 L16,7.80214133 L15.999,11.408 L16.952755,13.9951292 L16.9783684,14.079633 L16.9783684,14.079633 L16.9938547,14.1664103 L16.9990526,14.2545575 C16.9990526,14.5696589 16.8033539,14.8450086 16.4770902,14.9617822 L16.3635892,14.9946706 L16.2490526,15.0045575 L3.75135386,15.0045575 C3.66285683,15.0045575 3.57505818,14.988895 3.49201998,14.9582946 C3.20511956,14.852569 3.01635675,14.5864736 3.00957566,14.2422232 L3.01417037,14.1246913 L3.04761674,13.9952236 L3.999,11.411 L4.00008717,7.79280502 L4.0043877,7.56823794 C4.12700142,4.45115016 6.77102557,2 9.99764302,2 Z" id="🎨-Color"></path>
        </g>
    </g>
</svg>
  )};
export default Alert20FilledIcon;
