import * as React from 'react';
  const ShareStop24RegularIcon = () => {
    <?xml version="1.0" encoding="UTF-8"?>
<svg width="24px" height="24px" viewBox="0 0 24 24" version="1.1" xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink">
    <!-- Generator: Sketch 64 (93537) - https://sketch.com -->
    <title>ic_fluent_share_stop_24_regular</title>
    <desc>Created with Sketch.</desc>
    <g id="🔍-System-Icons" stroke="none" stroke-width="1" fill="none" fill-rule="evenodd">
        <g id="ic_fluent_share_stop_24_regular" fill="#212121" fill-rule="nonzero">
            <path d="M19.75,4 C20.9926,4 22,5.00736 22,6.25 L22,17.75 C22,18.9926 20.9926,20 19.75,20 L4.25,20 C3.00736,20 2,18.9926 2,17.75 L2,6.25 C2,5.00736 3.00736,4 4.25,4 L19.75,4 Z M19.75,5.5 L4.25,5.5 C3.83579,5.5 3.5,5.83579 3.5,6.25 L3.5,17.75 C3.5,18.1642 3.83579,18.5 4.25,18.5 L19.75,18.5 C20.1642,18.5 20.5,18.1642 20.5,17.75 L20.5,6.25 C20.5,5.83579 20.1642,5.5 19.75,5.5 Z M9.28033,8.21515 L12.0007,10.9356 L14.7249,8.21893 C15.0182,7.92644 15.4931,7.9271 15.7856,8.2204 C16.0781,8.5137 16.0774,8.98857 15.7841,9.28106 L13.0614,11.9962 L15.7848,14.7197 C16.0777,15.0126 16.0777,15.4874 15.7848,15.7803 C15.4919,16.0732 15.0171,16.0732 14.7242,15.7803 L12.0004,13.0565 L9.2807,15.78 C8.98801,16.0731 8.51314,16.0734 8.22004,15.7807 C7.92694,15.488 7.92661,15.0131 8.2193,14.72 L10.9397,11.9958 L8.21967,9.27581 C7.92678,8.98292 7.92678,8.50805 8.21967,8.21515 C8.51256,7.92226 8.98744,7.92226 9.28033,8.21515 Z" id="🎨-Color"></path>
        </g>
    </g>
</svg>
  };
export default ShareStop24RegularIcon;
